# Construindo o dataframe a partir dos dados

In [2]:
import pandas as pd
import numpy as np
from collections import OrderedDict

In [3]:
data = OrderedDict(
{
'País': ['Bélgica', 'Índia', 'Brasil','Índia'],
'Capital': ['Bruxelas', 'Nova Delhi', 'Brasília', 'Nova Delhi'],
'População': [123465, 456789, 987654, 456789]
})

In [4]:
df = pd.DataFrame(data)

In [5]:
# Apresentando o dataframe original:

df

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654
3    Índia  Nova Delhi     456789

In [6]:
# Expurgando os duplicados:

df_clean = df.drop_duplicates()
df_clean

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

In [7]:
# Selecionando os duplicados:

paises = df.País
df_duplicates = df[paises.isin(paises[paises.duplicated()])]
df_duplicates

    País     Capital  População
1  Índia  Nova Delhi     456789
3  Índia  Nova Delhi     456789